## Import Dependencies

In [1]:
import warnings
warnings.filterwarnings('ignore')

import numpy as np
import pandas as pd
from collections import Counter

from pathlib import Path

import sqlite3

In [2]:
## Get the names of the tables in the data base db2_w2tables.sqlite

conn = sqlite3.connect('db2_w2tables.sqlite')
c = conn.cursor()
c.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(c.fetchall())

[('table_users2',), ('table_city2',)]

## Extract first table and get DataFrame from it

In [3]:
### Example extracting the names of the columns in the table table_users2 
## IN DATABASE db2_w2tables.sqlite

connection = sqlite3.connect('db2_w2tables.sqlite')
connection.row_factory = sqlite3.Row
cursor = connection.execute('select * from table_users2')
# instead of cursor.description:
row = cursor.fetchone()
row_names = row.keys()
row_names

['user_id2', 'username2']

In [4]:
table_users2_data = c.execute('''SELECT * FROM table_users2 ''').fetchall()

In [5]:
table_users2_data

[(1, 'Paco'), (2, 'Pedro'), (3, 'Jhon'), (4, 'Peter'), (5, 'Julia')]

## Make dataframe from retrieved data

In [6]:
df_table_users2_data = pd.DataFrame(table_users2_data, 
                     columns=["user_id2", "username2"])

In [7]:
df_table_users2_data

   user_id2 username2
0         1      Paco
1         2     Pedro
2         3      Jhon
3         4     Peter
4         5     Julia